// 1. 谈谈你对工程化的初步认识, 结合你之前遇到过的问题说出三个以上工程化能够解决问题或者带来的价值
// 在以前页面简单的时候我们只需要写写简单的静态页面样式，和少量的js在那个时期的前端还只是被归类到设计的行列。但是随着后面前端业务越来越复杂。只写少量的样式和js维护起来会非常麻烦,所以后来提出了前端工程化的概念。我认为前端工程化是相教于前端对前端开发中所遇到的问题所设计出来的一系列解决方案
// 我认为现在的前端工程化所包含的工程有: 项目创建(各种各样的cli帮助创建解决了创建项目所带来的时间小号)=>项目构建打包(对项目进行体积压缩和代码优化等)=>项目模块化开发(对应前端所提供了各种各样的模块化解决方案js(AMD CMD) css(SASS LESS))=>项目组件化开发(REACT VUE)=>测试(JEST MOCK)=>代码托管(GIT)=>代码的持续集成与部署(CI CD)
// 通过前端工程化一系列的方案，可以帮助我们更方便的开发前端项目

// 2. 你认为脚手架除了为我们创建项目结构, 还有什么更深的意义
// 还可以为我们约定项目开发的规范

// 3. 脚手架实现工程 => cli/
// 4. gulp完成项目 => pages-boilerplate/